# ENSO Analysis

## Data Validation

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

import warnings
warnings.filterwarnings('ignore')

### tao-all dataset

In [2]:
# Getting columns names for tao-all dataset
tao_col = open('../data/tao-all2.col', 'r')
col_names_tao = tao_col.readlines()
col_names_tao

['obs\n',
 'year\n',
 'month\n',
 'day\n',
 'date\n',
 'latitude\n',
 'longitude\n',
 'zon.winds\n',
 'mer.winds\n',
 'humidity\n',
 'air temp.\n',
 's.s.temp.\n']

In [3]:
col_names_tao = [i.replace('\n', '') for i in col_names_tao]

In [4]:
# Loading tao-all2.dat file
tao = pd.read_csv('../data/tao-all2.dat', sep = '\s+', names = col_names_tao, header = None)
# Renaming columns
tao.rename(columns = {'zon.winds':'zonal_winds', 'mer.winds':'meridional_winds', 'air temp.':'air_temperature', 's.s.temp.':'sea_surface_temperature'}, inplace = True)

In [5]:
tao.head()

,obs,year,month,day,date,latitude,longitude,zonal_winds,meridional_winds,humidity,air_temperature,sea_surface_temperature
0,1,80,3,7,800307,-0.02,-109.46,-6.8,0.7,.,26.14,26.24
1,2,80,3,8,800308,-0.02,-109.46,-4.9,1.1,.,25.66,25.97
2,3,80,3,9,800309,-0.02,-109.46,-4.5,2.2,.,25.69,25.28
3,4,80,3,10,800310,-0.02,-109.46,-3.8,1.9,.,25.57,24.31
4,5,80,3,11,800311,-0.02,-109.46,-4.2,1.5,.,25.3,23.19

In [6]:
# Replacing . for nan
tao.replace('.', np.nan, inplace = True)

In [7]:
# Changing columns to their appropiate type
col_types = {'date': str, 'zonal_winds': float, 'meridional_winds': float, 'humidity': float, 'air_temperature': float, 'air_temperature': float, 'sea_surface_temperature': float}
tao = tao.astype(col_types)
tao['date'] = pd.to_datetime(tao['date'], yearfirst = True)

In [8]:
tao.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178080 entries, 0 to 178079
Data columns (total 12 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   obs                      178080 non-null  int64
 1   year                     178080 non-null  int64
 2   month                    178080 non-null  int64
 3   day                      178080 non-null  int64
 4   date                     178080 non-null  datetime64[ns]
 5   latitude                 178080 non-null  float64
 6   longitude                178080 non-null  float64
 7   zonal_winds              152917 non-null  float64
 8   meridional_winds         152918 non-null  float64
 9   humidity                 112319 non-null  float64
 10  air_temperature          159843 non-null  float64
 11  sea_surface_temperature  161073 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(4)
memory usage: 16.3 MB

In [9]:
# Counting number of different unique values in each column
tao.nunique()

obs                        178080
year                           19
month                          12
day                            31
date                         6371
latitude                      682
longitude                    1657
zonal_winds                   238
meridional_winds              216
humidity                      394
air_temperature              1184
sea_surface_temperature      1264
dtype: int64

* The *obs* column is a unique identifier of the observation, we can drop this column as it would not add any value to the analysis.

In [10]:
# Droping obs column
tao.drop(columns=['obs'], inplace = True)

In [11]:
# Searching for duplicated general dupliated rows and on date, latitude, longitude
print(tao.duplicated().any())
print(tao[['date', 'latitude', 'longitude']].duplicated().any())

False
False

* There are no duplicated rows in our dataset.

### elnino dataset

In [12]:
# Getting columns names for elnino dataset
elnino_col = open('../data/elnino.col', 'r')
col_names_elnino = elnino_col.readlines()
col_names_elnino = [i.replace('\n', '') for i in col_names_elnino]
col_names_elnino

['buoy',
 'day',
 'latitude',
 'longitude',
 'zon.winds',
 'mer.winds',
 'humidity',
 'air temp.',
 's.s.temp.']

In [13]:
# Loading elnino file
elnino = pd.read_csv('../data/elnino', sep = '\s+', names = col_names_elnino, header = None)
# Renaming columns
elnino.rename(columns = {'zon.winds':'zonal_winds', 'mer.winds':'meridional_winds', 'air temp.':'air_temperature', 's.s.temp.':'sea_surface_temperature'}, inplace = True)

In [14]:
elnino.head()

,buoy,day,latitude,longitude,zonal_winds,meridional_winds,humidity,air_temperature,sea_surface_temperature
0,1,1,8.96,-140.32,-6.3,-6.4,83.5,27.32,27.57
1,1,2,8.95,-140.32,-5.7,-3.6,86.4,26.70,27.62
2,1,3,8.96,-140.32,-6.2,-5.8,83.0,27.36,27.68
3,1,4,8.96,-140.34,-6.4,-5.3,82.2,27.32,27.70
4,1,5,8.96,-140.33,-4.9,-6.2,87.3,27.09,27.85

In [15]:
# Replacing . for nan
elnino.replace('.', np.nan, inplace = True)

In [16]:
elnino.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 782 entries, 0 to 781
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   buoy                     782 non-null    int64
 1   day                      782 non-null    int64
 2   latitude                 782 non-null    float64
 3   longitude                782 non-null    float64
 4   zonal_winds              677 non-null    object
 5   meridional_winds         677 non-null    object
 6   humidity                 624 non-null    object
 7   air_temperature          684 non-null    object
 8   sea_surface_temperature  709 non-null    object
dtypes: float64(2), int64(2), object(5)
memory usage: 55.1+ KB

* Since *buoy* is not a part of our larger dataset and it is an identifier of the buoy making the measurements we will drop this column.

In [17]:
elnino.drop(columns = ['buoy'], inplace = True)

* The *elnino* dataset does not have a complete date for the observations on it, but we know the observations were made from 23 May 98 to 5 June 98; this means that we can get the dates of the observations as shown below.

In [18]:
elnino['day'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14],
      dtype=int64)

In [19]:
# Dictionary to replace day column with correct day according to description
# May dictionary
may_keys = list(range(1,10))
may_values = [str(i) for i in list(range(23,32))]
may_dict = {may_keys[i] : may_values[i] for i in range(len(may_keys))}
# June dictionary
june_keys = list(range(10,15))
june_values = [str(0)+str(i) for i in list(range(1,6))]
june_dict = {june_keys[i] : june_values[i] for i in range(len(june_keys))}
# Complete dictionary
day_dict = may_dict | june_dict

In [20]:
# Replacing values of day columns with correct days 
elnino['day'].replace(day_dict, inplace = True)

In [21]:
# Inserting year column
elnino.insert(loc = 0, column = 'year', value = '98')

In [22]:
# Inserting month 
month_conditions = [
    elnino['day'].isin(may_values) ,
    elnino['day'].isin(june_values)
]

month_values = ['05', '06']
elnino.insert(loc = 1, column = 'month', value = np.select(month_conditions, month_values))

In [23]:
# Inserting date column
elnino['date'] = elnino['year'] + elnino['month'] + elnino['day']

In [24]:
# Changing order of columns
elnino = elnino.iloc[:,[0,1,2,10,3,4,5,6,7,8,9]]

In [25]:
# Changing columns to their appropiate type
col_types = {'year': int, 'month': int, 'day': int, 'zonal_winds': float, 'meridional_winds': float, 'humidity': float, 'air_temperature': float, 
             'air_temperature': float, 'sea_surface_temperature': float}
elnino = elnino.astype(col_types)
elnino['date'] = pd.to_datetime(elnino['date'], yearfirst = True)

In [26]:
# Counting number of different unique values in each column
elnino.nunique()

year                         1
month                        2
day                         14
date                        14
latitude                    88
longitude                  123
zonal_winds                113
meridional_winds           121
humidity                   179
air_temperature            321
sea_surface_temperature    328
dtype: int64

In [27]:
# Searching for duplicated general dupliated rows and on date, latitude, longitude
print(elnino.duplicated().any())
print(elnino[['date', 'latitude', 'longitude']].duplicated().any())

False
True

In [28]:
# Looking at duplicated rows
elnino[elnino[['date', 'latitude', 'longitude']].duplicated(keep = False)]

,year,month,day,date,latitude,longitude,zonal_winds,meridional_winds,humidity,air_temperature,sea_surface_temperature
328,98,5,28,1998-05-28,8.0,-179.91,NaN,NaN,NaN,27.98,28.38
329,98,5,28,1998-05-28,8.0,-179.91,NaN,NaN,NaN,27.86,28.41

* Assuming the observations are made once a day for each buoy (which is a fair asumption given this is only happening for this rows), having two observations with the same *date*, *latitude* and *longitude* will mean the observations are the same observation and that the diffence between them come from some sort of error; since we don't have a reason to choose one of them we will average the columns with different values.

In [29]:
# Averaging duplicated values of the columns above
col_names = ['date', 'latitude', 'longitude']
summaries = {'year': 'first', 'month': 'first', 'day': 'first', 'zonal_winds' : 'first', 'meridional_winds' : 'first',
             'humidity': 'first', 'air_temperature':'mean', 'sea_surface_temperature' : 'mean'}
elnino = elnino.groupby(by=col_names).agg(summaries).reset_index()

In [30]:
elnino = elnino.iloc[:,[3,4,5,0,1,2,6,7,8,9,10]]

In [31]:
elnino.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 781 entries, 0 to 780
Data columns (total 11 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   year                     781 non-null    int32
 1   month                    781 non-null    int32
 2   day                      781 non-null    int32
 3   date                     781 non-null    datetime64[ns]
 4   latitude                 781 non-null    float64
 5   longitude                781 non-null    float64
 6   zonal_winds              677 non-null    float64
 7   meridional_winds         677 non-null    float64
 8   humidity                 624 non-null    float64
 9   air_temperature          683 non-null    float64
 10  sea_surface_temperature  708 non-null    float64
dtypes: datetime64[ns](1), float64(7), int32(3)
memory usage: 58.1 KB

### enso dataset

In [32]:
# Concatenating the datasets
enso = pd.concat([tao, elnino])

In [33]:
enso.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 178861 entries, 0 to 780
Data columns (total 11 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   year                     178861 non-null  int64
 1   month                    178861 non-null  int64
 2   day                      178861 non-null  int64
 3   date                     178861 non-null  datetime64[ns]
 4   latitude                 178861 non-null  float64
 5   longitude                178861 non-null  float64
 6   zonal_winds              153594 non-null  float64
 7   meridional_winds         153595 non-null  float64
 8   humidity                 112943 non-null  float64
 9   air_temperature          160526 non-null  float64
 10  sea_surface_temperature  161781 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(3)
memory usage: 16.4 MB

In [34]:
enso = enso.sort_values(by='date')
enso.head()

,year,month,day,date,latitude,longitude,zonal_winds,meridional_winds,humidity,air_temperature,sea_surface_temperature
0,80,3,7,1980-03-07,-0.02,-109.46,-6.8,0.7,NaN,26.14,26.24
1,80,3,8,1980-03-08,-0.02,-109.46,-4.9,1.1,NaN,25.66,25.97
2,80,3,9,1980-03-09,-0.02,-109.46,-4.5,2.2,NaN,25.69,25.28
3,80,3,10,1980-03-10,-0.02,-109.46,-3.8,1.9,NaN,25.57,24.31
4,80,3,11,1980-03-11,-0.02,-109.46,-4.2,1.5,NaN,25.30,23.19

In [35]:
# Searching for duplicated general dupliated rows and on date, latitude, longitude
print(enso.duplicated().any())
print(enso[['date', 'latitude', 'longitude']].duplicated().any())

True
True

In [36]:
print(enso.duplicated().sum())

714

In [37]:
enso.drop_duplicates(inplace=True)

In [38]:
print(enso[['date', 'latitude', 'longitude']].duplicated().any())

True

In [39]:
# Looking at duplicated rows
enso[enso[['date', 'latitude', 'longitude']].duplicated(keep = False)].sort_values(by=['date','latitude'])

,year,month,day,date,latitude,longitude,zonal_winds,meridional_winds,humidity,air_temperature,sea_surface_temperature
48,98,5,23,1998-05-23,5.02,-94.95,NaN,NaN,88.6,27.50,NaN
120107,98,5,23,1998-05-23,5.02,-94.95,NaN,NaN,88.6,27.50,30.03
55,98,5,23,1998-05-23,8.05,-110.15,-3.9,-1.2,NaN,28.84,29.66
147178,98,5,23,1998-05-23,8.05,-110.15,-3.9,-1.2,86.4,28.84,29.66
120108,98,5,24,1998-05-24,5.02,-94.95,NaN,NaN,81.5,28.61,29.96
...,...,...,...,...,...,...,...,...,...,...,...
744,98,6,4,1998-06-04,8.05,-110.15,4.3,4.2,NaN,27.92,29.87
753,98,6,5,1998-06-05,-5.01,-139.92,NaN,NaN,NaN,27.44,28.85
128819,98,6,5,1998-06-05,-5.01,-139.92,-7.2,-0.4,85.0,27.44,28.85
772,98,6,5,1998-06-05,4.97,146.99,NaN,NaN,NaN,28.80,29.40
106128,98,6,5,1998-06-05,4.97,146.99,-5.7,-1.0,82.2,28.80,29.40

* Making the same assumption about the observations as before we will average the columns with different values.

In [40]:
# Averaging duplicated values of the columns above
col_names = ['date', 'latitude', 'longitude']
summaries = {'year': 'first', 'month': 'first', 'day': 'first', 'zonal_winds' : 'mean', 'meridional_winds' : 'mean',
             'humidity': 'mean', 'air_temperature':'mean', 'sea_surface_temperature' : 'mean'}
enso = enso.groupby(by=col_names).agg(summaries).reset_index()

In [41]:
enso.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178113 entries, 0 to 178112
Data columns (total 11 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   date                     178113 non-null  datetime64[ns]
 1   latitude                 178113 non-null  float64
 2   longitude                178113 non-null  float64
 3   year                     178113 non-null  int64
 4   month                    178113 non-null  int64
 5   day                      178113 non-null  int64
 6   zonal_winds              152938 non-null  float64
 7   meridional_winds         152939 non-null  float64
 8   humidity                 112340 non-null  float64
 9   air_temperature          159870 non-null  float64
 10  sea_surface_temperature  161100 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(3)
memory usage: 14.9 MB

## EDA